УТ/src/DataProcessors/CRM_НастройкиПользователей/CRM_НастройкиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>CRM_НастройкиПользователей</name>
</mdclass:DataProcessor>

УТ/src/InformationRegisters/CRM_ОповещенияПользовательскиеНастройки/CRM_ОповещенияПользовательскиеНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ОповещенияПользовательскиеНастройки</name>
  <attributes>
    <name>СрокОповещения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.CRM_ПериодичностьОповещений</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СМС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Мессенджер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Напоминание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Хранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВидОповещения</name>
    <type>
      <types>CatalogRef.CRM_ВидыОповещений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/Enums/CRM_ВариантыПоставки/CRM_ВариантыПоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ВариантыПоставки</name>
  <enumValues>
    <name>СТАРТ</name>
  </enumValues>
  <enumValues>
    <name>БАЗОВАЯ</name>
  </enumValues>
  <enumValues>
    <name>СТАНДАРТ</name>
  </enumValues>
  <enumValues>
    <name>ПРОФ</name>
  </enumValues>
  <enumValues>
    <name>КОРП</name>
  </enumValues>
</mdclass:Enum>

УТ/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ДолжностнаяПозиция</name>
    <type>
      <types>CatalogRef.CRM_ДолжностныеПозиции</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтписалсяОтEmailРассылок</name>
    <comment>Отписался от Email рассылок</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Планируемый</name>
    <comment>Участвует в планировании проектов</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Фотография</name>
    <comment>Фотография клиента частное лицо</comment>
    <type>
      <types>CatalogRef.ПользователиПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЕмейлДляСинхронизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РазрешеноИзменятьКоординаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ТехподдержкаЛогинПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>сфпВремяЗадержкиНабораДобавочногоНомера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>сфпПрефиксНабора</name>
      <type>
        <types>CatalogRef.сфпПрефиксыИсходящихВызовов</types>
      </type>
    </attributes>
    <attributes>
      <name>CRM_ОсновнойДляСвязи</name>
      <comment>Основной вид контактной информации для связи</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ДополнительнаяИнформация</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/ChartsOfCharacteristicTypes/CRM_НастройкиПользователей/CRM_НастройкиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>CRM_НастройкиПользователей</name>
  <comment>АПК:265 не проверять на орфографию имя</comment>
  <type>
    <types>CatalogRef.CRM_КалендариСотрудников</types>
    <types>EnumRef.CRM_ВариантыОтображенияНапоминаний</types>
    <types>EnumRef.CRM_ВариантыПоставки</types>
    <types>CatalogRef.CRM_Категории</types>
    <types>CatalogRef.CRM_СостоянияИнтересов</types>
    <types>CatalogRef.Организации</types>
    <types>CatalogRef.СтруктураПредприятия</types>
    <types>Boolean</types>
    <types>CatalogRef.ВидыЦен</types>
    <types>CatalogRef.Пользователи</types>
    <types>EnumRef.КомпанияЧастноеЛицо</types>
    <types>CatalogRef.CRM_СервисыРассылок</types>
    <types>CatalogRef.CRM_ТипыОтношений</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <types>EnumRef.CRM_ВариантыОформленийМессенджера</types>
    <types>CatalogRef.CRM_ВидыРабот</types>
    <types>CatalogRef.CRM_ТипыОбращений</types>
    <types>CatalogRef.Проекты</types>
    <types>CatalogRef.CRM_ТипУслуги</types>
    <numberQualifiers>
      <precision>30</precision>
    </numberQualifiers>
    <stringQualifiers>
      <length>255</length>
    </stringQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Google</name>
      <description>Google</description>
      <code>05000</code>
      </content>
    </items>
    <items>
      <name>НастройкиКалендаря</name>
      <description>Настройки календаря</description>
      <code>03000</code>
    </items>
    <items>
      <name>сфпНастройкиСофтФон</name>
      <description>Настройки СофтФон</description>
      <code>90000</code>
      </content>
      </content>
    </items>
    <items>
      <name>ОбщиеНастройки</name>
      <description>Общие настройки</description>
      <code>04000</code>
    </items>
    <items>
      <name>ОсновныеЗначенияДляПодстановки</name>
      <description>Основные значения для подстановки в документы и справочники</description>
      <code>02000</code>
    </items>
    <items>
      <name>ПараметрыИспользованияCRM</name>
      <description>Параметры использования 1С:CRM</description>
      <code>01100</code>
    </items>
    <items>
      <name>СинхронизацияКалендарей</name>
      <description>Синхронизация календарей</description>
      <code>06000</code>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

УТ/src/DataProcessors/CRM_НастройкиПользователей/Forms/КопированиеНастроекПользователей/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПереключательКомуКопироватьНастройки = "ВыбраннымПользователям";
	РежимОткрытияФормы = Параметры.РежимОткрытияФормы;
	
	ПользователиПолучателиНастроек = Новый Структура;
	
	Если Параметры.Пользователь <> Неопределено Тогда
		МассивПользователей = Новый Массив;
		МассивПользователей.Добавить(Параметры.Пользователь);
		ПользователиПолучателиНастроек.Вставить("МассивПользователей", МассивПользователей);
		Элементы.ВыбратьПользователей.Заголовок = Строка(Параметры.Пользователь);
		КоличествоПользователей = 1;
		ТипПереданногоПользователя = ТипЗнч(Параметры.Пользователь);
		Элементы.ГруппаКомуКопировать.Доступность = Ложь;
	Иначе
		ПользовательСсылка = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если ПользовательСсылка = Неопределено Тогда
		Элементы.ГруппаКопируемыеНастройки.Доступность = Ложь;
	КонецЕсли;
	
	// +СофтФон
	сфпПривязкаНомера = сфпСофтФонПроСервер.сфпПолучитьЗначениеНастройкиПользователя("сфпПривязатьВнутреннийНомер");
	сфпМассивАвтоматическихДействий = сфпСофтФонПроСерверПереопределяемый.сфпПолучитьМассивДоступныхДействий();
	
	Для Каждого ЭлементМассива Из сфпМассивАвтоматическихДействий Цикл
		сфпСписокАвтоматическихДействий.Добавить(ЭлементМассива.Наименование);
	КонецЦикла;
	// -СофтФон
	
	ОчиститьИсториюВыбораНастроек = Истина;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ВРег(ИмяСобытия) = ВРег("ВыборПользователя") Тогда
		Если Источник <> ИмяФормы Тогда
			Возврат;
		КонецЕсли;
		
		ПользователиПолучателиНастроек = Новый Структура("МассивПользователей", Параметр.ПользователиПриемник);
		КоличествоПользователей = Параметр.ПользователиПриемник.Количество();
		
		Если КоличествоПользователей = 1 Тогда
			Элементы.ВыбратьПользователей.Заголовок = Строка(Параметр.ПользователиПриемник[0]);
		ИначеЕсли КоличествоПользователей > 1 Тогда
			ЧислоИПредмет = Формат(КоличествоПользователей, "ЧДЦ=0") + " "
				+ ПользователиСлужебныйКлиентСервер.ПредметЦелогоЧисла(КоличествоПользователей,
					"", НСтр("ru = 'пользователь,пользователя,пользователей,,,,,,0'"));
			Элементы.ВыбратьПользователей.Заголовок = ЧислоИПредмет;
		КонецЕсли;
		
		Элементы.ВыбратьПользователей.Подсказка = "";
	КонецЕсли;
	
КонецПроцедуры // ОбработкаОповещения()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПользовательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбранныйТипПользователей = Неопределено;
	
	Если КоличествоПользователей <> 0 Тогда
		СкрываемыеПользователи = Новый СписокЗначений;
		СкрываемыеПользователи.ЗагрузитьЗначения(ПользователиПолучателиНастроек.МассивПользователей);
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура(
		"РежимВыбора, СкрываемыеПользователи",
		Истина, СкрываемыеПользователи);
	
	ОткрытьФорму("Справочник.Пользователи.ФормаСписка", ПараметрыОтбора, Элементы.ПользовательСсылка);
	ПользовательСсылкаСтарый = ПользовательСсылка;
	
КонецПроцедуры // ПользовательНачалоВыбора()

&НаКлиенте
Процедура ПользовательСсылкаПриИзменении(Элемент)
	
	Если ПользовательСсылка <> Неопределено
		И ИмяПользователяИБ(ПользовательСсылка) = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'У выбранного пользователя нет настроек, которые можно было бы
				|скопировать, выберите другого пользователя.'"));
		ПользовательСсылка = ПользовательСсылкаСтарый;
		Возврат;
	КонецЕсли;
	
	Если ПользовательСсылка <> Неопределено
		И ПользователиПолучателиНастроек.Свойство("МассивПользователей") Тогда
		
		Если ПользователиПолучателиНастроек.МассивПользователей.Найти(ПользовательСсылка) <> Неопределено Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Нельзя копировать настройки пользователя самому себе,
					|выберите другого пользователя.'"));
				ПользовательСсылка = ПользовательСсылкаСтарый;
				Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ГруппаКопируемыеНастройки.Доступность = ПользовательСсылка <> Неопределено;
	
КонецПроцедуры // ПользовательСсылкаПриИзменении()

&НаСервереБезКонтекста
Функция ИмяПользователяИБ(ПользовательСсылка)
	
	Возврат Обработки.CRM_НастройкиПользователей.ИмяПользователяИБ(ПользовательСсылка);
	
КонецФункции // ИмяПользователяИБ()

&НаКлиенте
Процедура ВыбратьПользователей(Элемент)
	
	ВыбранныеПользователи = Неопределено;
	ПользователиПолучателиНастроек.Свойство("МассивПользователей", ВыбранныеПользователи);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Пользователь",          ПользовательСсылка);
	ПараметрыФормы.Вставить("ТипДействия",           "Копирование");
	ПараметрыФормы.Вставить("ВыбранныеПользователи", ВыбранныеПользователи);
	ПараметрыФормы.Вставить("Источник",              ИмяФормы);
	
	ОткрытьФорму("Обработка.CRM_НастройкиПользователей.Форма.ВыборПользователей", ПараметрыФормы);
	
КонецПроцедуры // ВыбратьПользователей()

&НаКлиенте
Процедура ПереключательКомуКопироватьНастройкиПриИзменении(Элемент)
	
	Если ПереключательКомуКопироватьНастройки = "ВыбраннымПользователям" Тогда
		Элементы.ВыбратьПользователей.Доступность = Истина;
	Иначе
		Элементы.ВыбратьПользователей.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры // ПереключательКомуКопироватьНастройкиПриИзменении()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Скопировать(Команда)
	
	ОчиститьСообщения();
	
	Если ПользовательСсылка = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Выберите пользователя, чьи настройки необходимо скопировать.'"), , "ПользовательСсылка");
		Возврат;
	КонецЕсли;
	
	Если КоличествоПользователей = 0 И ПереключательКомуКопироватьНастройки <> "ВсемПользователям" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Выберите одного или несколько пользователей, которым необходимо скопировать настройки.'"), , "Приемник");
		Возврат;
	КонецЕсли;
	
	Если Не ФлагВыгрузкиНастроек И Не ФлагВыгрузкиНастроекОповещения Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Выберите разделы настроек, которые необходимо скопировать.'"), , "ГруппаВыбрать");
		Возврат;
	КонецЕсли;
	
	СкопироватьНастройкиНаКлиенте(Команда.Имя);
	
КонецПроцедуры // Скопировать()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область КопированиеНастроек

&НаКлиенте
Процедура СкопироватьНастройкиНаКлиенте(ИмяКоманды)
	
	Если ПереключательКомуКопироватьНастройки = "ВыбраннымПользователям" Тогда
		ПояснениеКомуСкопированыНастройки = ПользователиСлужебныйКлиент.ПояснениеПользователи(
			КоличествоПользователей, ПользователиПолучателиНастроек.МассивПользователей[0]
		);
	Иначе
		ПояснениеКомуСкопированыНастройки = НСтр("ru = 'всем пользователям'");
	КонецЕсли;
	
	ТекстОповещения    = НСтр("ru = 'Копирование настроек'");
	КартинкаОповещения = БиблиотекаКартинок.Информация32;
	
	СкопироватьНастройкиНаСервере();
	
	Если ИмяКоманды = "СкопироватьИЗакрыть" Тогда
		Закрыть();
	КонецЕсли;
	
	ПояснениеОповещения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Скопированы выбранные настройки %1'"), ПояснениеКомуСкопированыНастройки
	);
	
	ПоказатьОповещениеПользователя(ТекстОповещения, , ПояснениеОповещения, КартинкаОповещения);
	
КонецПроцедуры

&НаСервере
Процедура СкопироватьНастройкиНаСервере()
	
	Если ПереключательКомуКопироватьНастройки = "ВыбраннымПользователям" Тогда
		Приемники = ПользователиПолучателиНастроек.МассивПользователей;
	Иначе
		Приемники = Новый Массив;
		
		ТаблицаПользователей = Новый ТаблицаЗначений;
		ТаблицаПользователей.Колонки.Добавить("Пользователь");
		ТаблицаПользователей.Колонки.Добавить("Подразделение");
		ТаблицаПользователей.Колонки.Добавить("ФизическоеЛицо");
		
		ТаблицаПользователей = Обработки.CRM_НастройкиПользователей.ПользователиДляКопирования(
			ПользовательСсылка,
			ТаблицаПользователей
		);
		
		Для Каждого СтрокаТаблицы Из ТаблицаПользователей Цикл
			Приемники.Добавить(СтрокаТаблицы.Пользователь);
		КонецЦикла;
	КонецЕсли;
	
	// Сохранение пользовательских настроек в регистр.
	Если ФлагВыгрузкиНастроек Тогда
		МассивНастроек = ПолучитьНастройкиПользователя();
		Для Каждого ПользовательПолучатель Из Приемники Цикл
			СохранитьНастройкиВРегистрСведений(МассивНастроек, ПользовательПолучатель);
		КонецЦикла;
	КонецЕсли;
	
	// Сохранение настроек оповещения.
	Если ФлагВыгрузкиНастроекОповещения Тогда
		МассивНастроекОповещения = ПолучитьНастройкиОповещения();
		Для Каждого ПользовательПолучатель Из Приемники Цикл
			СохранитьНастройкиОпевещения(МассивНастроекОповещения, ПользовательПолучатель);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // СкопироватьНастройкиНаСервере()

#КонецОбласти

#Область СохранениеНастроекВБазу

&НаСервере
Процедура СохранитьНастройкиВРегистрСведений(МассивНастроек, Пользователь)
	
	НаборЗаписей = РегистрыСведений.CRM_НастройкиПользователей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Для Каждого СтрокаНастроек Из МассивНастроек Цикл
		ЗаписьРегистра = НаборЗаписей.Добавить();
		ЗаписьРегистра.Пользователь	= Пользователь;
		ЗаписьРегистра.Настройка	= СтрокаНастроек.Настройка;
		ЗаписьРегистра.Значение		= СтрокаНастроек.Настройка.ТипЗначения.ПривестиЗначение(СтрокаНастроек.Значение);
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры // СохранитьНастройкиВРегистрСведений()

&НаСервере
Процедура СохранитьНастройкиОпевещения(МассивОповещений, Пользователь)
	
	НаборЗаписей = РегистрыСведений.CRM_ОповещенияПользовательскиеНастройки.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Для Каждого СтрокаНастроек Из МассивОповещений Цикл
		Запись = НаборЗаписей.Добавить();
		
		Запись.Пользователь		= Пользователь;
		Запись.ВидОповещения	= СтрокаНастроек.ВидОповещения;
		Запись.СрокОповещения	= СтрокаНастроек.СрокОповещения;
		Запись.Периодичность	= СтрокаНастроек.Периодичность;
		Запись.Напоминание		= СтрокаНастроек.Напоминание;
		Запись.СМС				= СтрокаНастроек.СМС;
		Запись.ЭлектроннаяПочта	= СтрокаНастроек.ЭлектроннаяПочта;
		
		Если СтрокаНастроек.ВидОповещения = Справочники.CRM_ВидыОповещений.КоммерческоеПредложениеСумма
				ИЛИ СтрокаНастроек.ВидОповещения = Справочники.CRM_ВидыОповещений.СчетСумма Тогда
			Запись.Сумма = СтрокаНастроек.Отбор;
		ИначеЕсли СтрокаНастроек.ВидОповещения <> Справочники.CRM_ВидыОповещений.ОповещатьОНовыхВходящихПисьмах 
			И СтрокаНастроек.ВидОповещения <> Справочники.CRM_ВидыОповещений.ОповещатьОНовыхСообщенияхМессенджеров Тогда
			Если ЭтоАдресВременногоХранилища(СтрокаНастроек.Хранилище) Тогда
				Запись.Хранилище = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(СтрокаНастроек.Хранилище),
					 Новый СжатиеДанных(9));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры // СохранитьНастройкиОпевещения()

#КонецОбласти

#Область ПолучениеНастроек

&НаСервере
Функция ПолучитьНастройкиПользователя()
	
	МассивНастроек = Новый Массив;
	
	// +СофтФон
	сфпИспользоватьСофтФон = ПолучитьФункциональнуюОпцию("сфпИспользоватьСофтФон");
	// -СофтФон
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", ПользовательСсылка);
	Запрос.Текст = "ВЫБРАТЬ
	|	Настройки.Код КАК Код,
	|	Настройки.Родитель КАК Родитель,
	|	Настройки.Ссылка КАК Ссылка,
	|	Настройки.ЭтоГруппа КАК ЭтоГруппа,
	|	НЕ Настройки.ЭтоГруппа КАК НомерКартинки,
	|	Настройки.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
	|	Константы.ФункциональнаяОпцияУчетПоНесколькимОрганизациям КАК ФункциональнаяОпцияУчетПоНесколькимОрганизациям,
	|	ЗначениеНастроек.Значение КАК Значение
	|ИЗ
	|	ПланВидовХарактеристик.CRM_НастройкиПользователей КАК Настройки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_НастройкиПользователей КАК ЗначениеНастроек
	|		ПО (ЗначениеНастроек.Настройка = Настройки.Ссылка)
	|			И (ЗначениеНастроек.Пользователь = &Пользователь),
	|	Константы КАК Константы
	|ГДЕ
	|	НЕ Настройки.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.CRM_НастройкиПользователей.ОсновнаяОрганизация)
	|					И НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимОрганизациям
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	// +Календари
	// Скрытие устаревших настроек календарей Google.
	|	И ВЫБОР
	|			КОГДА Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.CRM_НастройкиПользователей.IDКаналаGApi)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.CRM_НастройкиПользователей.ВремяЖизниКаналаGApi)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.CRM_НастройкиПользователей.ВремяЖизниТокенаAPI)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.CRM_НастройкиПользователей.КалендарьGoogle)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.CRM_НастройкиПользователей.ИдКалендаряКанала)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.CRM_НастройкиПользователей.КалендарьGoogleПредставление)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.CRM_НастройкиПользователей.СинхронизироватьКалендарьGoogle)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.CRM_НастройкиПользователей.AccessTokenGApi)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.CRM_НастройкиПользователей.RefreshTokenGApi)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.CRM_НастройкиПользователей.ЧасовойПоясКалендаряGApi)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.CRM_НастройкиПользователей.НастройкиКалендаряGoogle)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.CRM_НастройкиПользователей.Google)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	// Скрытие настроек синхронизации календарей - редактируются в отдельной закладке.
	|	И ВЫБОР
	|			КОГДА Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.CRM_НастройкиПользователей.СинхронизацияКалендарей)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.CRM_НастройкиПользователей.КалендарьДляСинхронизации)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	// -Календари
	|	//ТекстИсключенияНастроекДляСпарки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтоГруппа ИЕРАРХИЯ УБЫВ,
	|	Настройки.Код";
	
	Если НЕ CRM_ОбщегоНазначенияСервер.НайтиВМетаданныхПоИмени("Константы",
		 "ФункциональнаяОпцияУчетПоНесколькимОрганизациям") Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Константы.ФункциональнаяОпцияУчетПоНесколькимОрганизациям", "ИСТИНА");
		
	КонецЕсли;
	
	// Скрытие неактуальных настроек:
	ТекстИсключенияНастроекДляСпарки = "";
	Если НЕ CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		ТекстИсключенияНастроекДляСпарки = "И ВЫБОР
		|			КОГДА Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.CRM_НастройкиПользователей.ОсновнойВидЦенПродажи)
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ТекстИсключенияНастроекДляСпарки", ТекстИсключенияНастроекДляСпарки);
	
	// Скрытие неактуальных настроек:
	ТекстИсключенияНастроекДляСпарки = "";
	Если НЕ CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		ТекстИсключенияНастроекДляСпарки = "И ВЫБОР
		|			КОГДА Настройки.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.CRM_НастройкиПользователей.ОсновнойВидЦенПродажи)
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ТекстИсключенияНастроекДляСпарки", ТекстИсключенияНастроекДляСпарки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
			КодНастройки = Число(Выборка.Код);
		Исключение	
			КодНастройки = 0;
		КонецПопытки;
		
		Если СтрНайти(Выборка.ИмяПредопределенныхДанных, "Удалить_") = 1 Тогда
			Продолжить;
		КонецЕсли; 
		
		Если Выборка.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		
		Если Выборка.Ссылка = ПланыВидовХарактеристик.CRM_НастройкиПользователей.ОсновнойТипУслуг
			 И НЕ ПолучитьФункциональнуюОпцию("CRM_ИспользоватьТипыУслуг") Тогда
			Продолжить;
		КонецЕсли;
		Если Выборка.Ссылка = ПланыВидовХарактеристик.CRM_НастройкиПользователей.ОсновнойТипОбращения
			 И НЕ ПолучитьФункциональнуюОпцию("CRM_ИспользоватьПоддержку") Тогда
			Продолжить;
		КонецЕсли;
		
		// +СофтФон
		Если НЕ сфпИспользоватьСофтФон Тогда
			Если Выборка.Ссылка = ПланыВидовХарактеристик.CRM_НастройкиПользователей.сфпДействиеПриВходящемЗвонке ИЛИ
				Выборка.Ссылка = ПланыВидовХарактеристик.CRM_НастройкиПользователей.сфпДействиеПриИсходящемЗвонке ИЛИ
				Выборка.Ссылка = ПланыВидовХарактеристик.CRM_НастройкиПользователей.сфпЗакрыватьПанельПриЗавершенииРаботы ИЛИ
				Выборка.Ссылка = ПланыВидовХарактеристик.CRM_НастройкиПользователей.сфпИспользоватьВнутреннююПанель ИЛИ
				Выборка.Ссылка = ПланыВидовХарактеристик.CRM_НастройкиПользователей.сфпИспользоватьСофтФон ИЛИ
				Выборка.Ссылка = ПланыВидовХарактеристик.CRM_НастройкиПользователей.сфпТекущийВнутреннийНомер ИЛИ
				Выборка.Ссылка = ПланыВидовХарактеристик.CRM_НастройкиПользователей.сфпЛогинНаСерверСофтФон ИЛИ
				Выборка.Ссылка = ПланыВидовХарактеристик.CRM_НастройкиПользователей.сфпПарольНаСерверСофтФон ИЛИ
				Выборка.Ссылка = ПланыВидовХарактеристик.CRM_НастройкиПользователей.сфпПривязатьВнутреннийНомер ИЛИ
				Выборка.Ссылка = ПланыВидовХарактеристик.CRM_НастройкиПользователей.сфпДополнительныеВнутренниеНомера
				Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		// -СофтФон
		
		Если Выборка.Ссылка = ПланыВидовХарактеристик.CRM_НастройкиПользователей.АвтоматическиЗапускатьТаймерУчетаРабочегоВремени
			 И Не ПолучитьФункциональнуюОпцию("CRM_ИспользоватьУчетРабочегоВремени") Тогда
			Продолжить;
		КонецЕсли;
		
		// +Fresh
		Если ОбщегоНазначения.РазделениеВключено() Тогда
			Если Выборка.Ссылка = ПланыВидовХарактеристик.CRM_НастройкиПользователей.АдминистраторМобильногоПриложения Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		// -Fresh
		
		Если НЕ РольДоступна("АдминистраторСистемы") Тогда
			Если Выборка.Ссылка = ПланыВидовХарактеристик.CRM_НастройкиПользователей.АдминистраторМобильногоПриложения Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		// Особеннности объединенных решений
		ИмяКонфигурации = Метаданные.Имя;
		
		Если ИмяКонфигурации = "CRM" Тогда
			Если Выборка.Ссылка = ПланыВидовХарактеристик.CRM_НастройкиПользователей.ИспользоватьCRM ИЛИ 
				Выборка.Ссылка = ПланыВидовХарактеристик.CRM_НастройкиПользователей.ИспользоватьТиповуюФормуРегистрацииНовогоПартнера 
				Тогда
				Продолжить;
			КонецЕсли;
		Иначе
			Если Выборка.Ссылка = ПланыВидовХарактеристик.CRM_НастройкиПользователей.ПодставлятьОсновнойПроектВПоручения Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		НастройкаПользователя = Новый Структура(
			"Значение,Настройка",
			Выборка.Значение, Выборка.Ссылка
		);
		МассивНастроек.Добавить(НастройкаПользователя);
		
		Если НастройкаПользователя.Настройка = ПланыВидовХарактеристик.CRM_НастройкиПользователей.сфпДействиеПриВходящемЗвонке Тогда
			ЭлементСписка = сфпСписокАвтоматическихДействий.НайтиПоЗначению(Выборка.Значение);
			
			Если ЭлементСписка = Неопределено Тогда
				ЭлементСписка = сфпСписокАвтоматическихДействий[0];
			КонецЕсли;
			
			НастройкаПользователя.Значение = ЭлементСписка.Значение;
		ИначеЕсли НастройкаПользователя.Настройка = ПланыВидовХарактеристик.CRM_НастройкиПользователей.сфпДействиеПриИсходящемЗвонке Тогда
			ЭлементСписка = сфпСписокАвтоматическихДействий.НайтиПоЗначению(Выборка.Значение);
			
			Если ЭлементСписка = Неопределено Тогда
				ЭлементСписка = сфпСписокАвтоматическихДействий[0];
			КонецЕсли;
			
			НастройкаПользователя.Значение = ЭлементСписка.Значение;
		Иначе
			НастройкаПользователя.Значение = Выборка.Ссылка.ТипЗначения.ПривестиЗначение(Выборка.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивНастроек;
	
КонецФункции // ПолучитьНастройкиПользователя()

&НаСервере
Функция ПолучитьНастройкиОповещения()
	
	МассивНастроекОповещения	= Новый Массив;
	СписокИсключаемыхВидов		= Новый СписокЗначений;
	
	СписокИсключаемыхВидов.Добавить(Справочники.CRM_ВидыОповещений.СрокДействияЛицензииИстекает); // Используется для iCRM.
	
	ОсновнойВариантПоставки = CRM_ЛицензированиеЭкспортныеМетоды.ПолучитьОсновнойВариантПоставки();
	
	Если ОсновнойВариантПоставки <> Перечисления.CRM_ВариантыПоставки.КОРП Тогда
		СписокИсключаемыхВидов.Добавить(Справочники.CRM_ВидыОповещений.ПросроченныеКонтрольныеТочки);
	КонецЕсли;
	
	Если НЕ УправлениеДоступом.ЕстьРоль("ПолныеПрава", , ПользовательСсылка) Тогда
		СписокИсключаемыхВидов.Добавить(Справочники.CRM_ВидыОповещений.ОшибкаСрабатыванияТриггера);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Пользователь",	ПользовательСсылка);
	Запрос.УстановитьПараметр("Исключения",		СписокИсключаемыхВидов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	CRM_ОповещенияПользовательскиеНастройки.ВидОповещения КАК ВидОповещения,
	|	CRM_ОповещенияПользовательскиеНастройки.Пользователь КАК Пользователь,
	|	CRM_ОповещенияПользовательскиеНастройки.СрокОповещения КАК СрокОповещения,
	|	CRM_ОповещенияПользовательскиеНастройки.Периодичность КАК Периодичность,
	|	CRM_ОповещенияПользовательскиеНастройки.ЭлектроннаяПочта КАК ЭлектроннаяПочта,
	|	CRM_ОповещенияПользовательскиеНастройки.СМС КАК СМС,
	|	CRM_ОповещенияПользовательскиеНастройки.Напоминание КАК Напоминание,
	|	CRM_ОповещенияПользовательскиеНастройки.Сумма КАК Сумма,
	|	CRM_ОповещенияПользовательскиеНастройки.Хранилище КАК Хранилище
	|ПОМЕСТИТЬ ПользовательскиеНастройки
	|ИЗ
	|	РегистрСведений.CRM_ОповещенияПользовательскиеНастройки КАК CRM_ОповещенияПользовательскиеНастройки
	|ГДЕ
	|	CRM_ОповещенияПользовательскиеНастройки.Пользователь = &Пользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	CRM_ВидыОповещений.Ссылка КАК ВидОповещения,
	|	CRM_ВидыОповещений.Код КАК Код,
	|	CRM_ВидыОповещений.Родитель КАК Родитель,
	|	ЕСТЬNULL(ПользовательскиеНастройки.Пользователь, &Пользователь) КАК Пользователь,
	|	ЕСТЬNULL(ПользовательскиеНастройки.СрокОповещения, 0) КАК СрокОповещения,
	|	ЕСТЬNULL(ПользовательскиеНастройки.Периодичность, ЗНАЧЕНИЕ(Перечисление.CRM_ПериодичностьОповещений.ПустаяСсылка)) КАК Периодичность,
	|	ЕСТЬNULL(ПользовательскиеНастройки.Напоминание, ЛОЖЬ) КАК Напоминание,
	|	ЕСТЬNULL(ПользовательскиеНастройки.СМС, ЛОЖЬ) КАК СМС,
	|	ЕСТЬNULL(ПользовательскиеНастройки.ЭлектроннаяПочта, ЛОЖЬ) КАК ЭлектроннаяПочта,
	|	ЕСТЬNULL(ПользовательскиеНастройки.Сумма, 0) КАК Сумма,
	|	ЕСТЬNULL(ПользовательскиеНастройки.Хранилище, НЕОПРЕДЕЛЕНО) КАК Хранилище
	|ИЗ
	|	Справочник.CRM_ВидыОповещений КАК CRM_ВидыОповещений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПользовательскиеНастройки КАК ПользовательскиеНастройки
	|		ПО CRM_ВидыОповещений.Ссылка = ПользовательскиеНастройки.ВидОповещения
	|ГДЕ
	|	НЕ CRM_ВидыОповещений.ЭтоГруппа
	|	И НЕ CRM_ВидыОповещений.ПометкаУдаления
	|	И НЕ CRM_ВидыОповещений.Ссылка В (&Исключения)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВидОповещения)
	|ПО
	|	Родитель";
	
	ВыборкаНастроекГруппа = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНастроекГруппа.Следующий() Цикл
		ВыборкаНастроекЭлементы = ВыборкаНастроекГруппа.Выбрать();
		
		Пока ВыборкаНастроекЭлементы.Следующий() Цикл
			НастройкаОповещения = Новый Структура;
			МассивНастроекОповещения.Добавить(НастройкаОповещения);
			
			НастройкаОповещения.Вставить("СМС",				ВыборкаНастроекЭлементы.СМС);
			НастройкаОповещения.Вставить("ЭлектроннаяПочта", ВыборкаНастроекЭлементы.ЭлектроннаяПочта);
			НастройкаОповещения.Вставить("Напоминание",		ВыборкаНастроекЭлементы.Напоминание);
			НастройкаОповещения.Вставить("ВидОповещения",	ВыборкаНастроекЭлементы.ВидОповещения);
			НастройкаОповещения.Вставить("Периодичность",	ВыборкаНастроекЭлементы.Периодичность);
			НастройкаОповещения.Вставить("СрокОповещения",	ВыборкаНастроекЭлементы.СрокОповещения);
			НастройкаОповещения.Вставить("Хранилище",		ВыборкаНастроекЭлементы.Хранилище);
			
			Если ВыборкаНастроекЭлементы.ВидОповещения = Справочники.CRM_ВидыОповещений.КоммерческоеПредложениеСумма
					ИЛИ ВыборкаНастроекЭлементы.ВидОповещения = Справочники.CRM_ВидыОповещений.СчетСумма Тогда
				НастройкаОповещения.Вставить("Отбор", ВыборкаНастроекЭлементы.Сумма);
			ИначеЕсли ВыборкаНастроекЭлементы.Хранилище <> Неопределено Тогда
				ЗначениеИзХранилища				= ВыборкаНастроекЭлементы.Хранилище.Получить();
				НастройкаОповещения.Хранилище	= ПоместитьВоВременноеХранилище(ЗначениеИзХранилища, УникальныйИдентификатор);
				
				НастройкаОповещения.Вставить("Отбор", Строка(ЗначениеИзХранилища));
			КонецЕсли;
			
			Если ВыборкаНастроекЭлементы.ВидОповещения = Справочники.CRM_ВидыОповещений.ОповещатьОНовыхВходящихПисьмах Тогда
				ОповещенияОВходящихПисьмахНапоминание		= ВыборкаНастроекЭлементы.Напоминание;
				ОповещенияОВходящихПисьмахСрокОповещения	= ВыборкаНастроекЭлементы.СрокОповещения;
				ОповещенияОВходящихПисьмахПериодичность		= ВыборкаНастроекЭлементы.Периодичность;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат МассивНастроекОповещения;
	
КонецФункции // ПолучитьНастройкиОповещения()

#КонецОбласти

#КонецОбласти
